example/posts/go-concurrency/go-concurrency.html
<p>
Go makes concurrency easy with goroutines and channels. In this post we explore the basic building blocks of concurrent programming in Go, using simple examples and patterns.
</p>
<div id="outline-container-org38fb806" class="outline-2">
<h2 id="org38fb806">Spawning Goroutines</h2>
<div class="outline-text-2" id="text-org38fb806">
<p>
Lorem ipsum dolor sit amet, consectetur adipiscing elit. Aliquam erat volutpat. Suspendisse vehicula mauris vitae nulla viverra, et feugiat sapien varius.
</p>
</div>
</div>
<div id="outline-container-org0e28ca9" class="outline-2">
<h2 id="org0e28ca9">Communicating with Channels</h2>
<div class="outline-text-2" id="text-org0e28ca9">
<p>
Curabitur sit amet metus mi. Integer feugiat congue magna, sed facilisis purus pellentesque eget. In consequat efficitur nunc.
</p>
</div>
</div>
